{"version":"7.24.0","datetime":"2020-05-09T04:26:50.000Z","timestamp":"1588998410","notes":{"Release Notes":["***\nHello! We hope you’re staying safe and healthy. Here’s what you can find in this Postman release:\n\n### What's New\n* Some big changes to the API Builder that make creating and linking API elements even easier:\n  * When you generate a collection, you now have the additional option to create a mock server or monitor on top of that collection. If you’d rather create a collection from scratch for a monitor or mock server, you can also do that directly from the API Builder. \n  * You can generate collections for documentation and test suites from the “Develop” and “Test” tabs that are automatically linked to your API. Previously, you could only link existing collections. \n* There’s a new encryption key you can set for an added layer of security when communicating with the Interceptor extension.\n* When generating OAuth2 tokens, you can now authenticate via your default browser\n[#7700](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7700),\n[#8059](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8059)\n* You can check in real-time whether your schema is synced to your GitHub repository.\n\n\n### Improvements\n* We've made various improvements to the code and description editors. Markdown descriptions have better syntax highlighting support now. In pre-request and test scripts, Postman variable suggestions now show up within relevant Postman Sandbox methods.\n* You can now “move” a collection or API to another workspace. When sharing it to another workspace, select the option to remove it from the current workspace.\n* Added additional import configurations for OpenAPI, RAML, and GraphQL files so that you can import your data exactly how you like it\n[#82](https:\/\/github.com\/postmanlabs\/openapi-to-postman\/issues\/82)\n* We've also optimized the workspace switcher modal for better performance.\n\n### Bug Fixes\n* Fixed an issue when importing schemas where path-level server objects in OpenAPI definitions were not handled correctly\n[#160](https:\/\/github.com\/postmanlabs\/openapi-to-postman\/issues\/160)\n* Fixed an issue where validation against OpenAPI definitions containing schemas of `type: array` didn't work properly\n[#8098](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8098)\n* cURL commands that use `--data-urlencode` now import correctly\n[#8292](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8292)\n* Fixed a bug in the Console where large numbers in JSON responses were being rounded up or down, creating discrepancies between “Raw” and “Pretty” views\n[#7822](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7822)\n* Fixed a bug in the Collection Runner where changing settings in the requester builder weren’t reflected in the runner window\n[#7968](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7968)\n* Fixed a bug in the Console, where it wouldn’t log intermediate requests while generating OAuth2 token\n[#7952](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7952)\n* Fixed a bug with collection runs, where disabled query params weren’t available in pre-request scripts\n[#7686](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7686)\n* Fixed a bug where adding a value to a query param that was previously empty would cause the params to be sent incorrectly\n[#8251](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8251),\n[#8374](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8374)\n* Fixed an issue when importing OpenAPI definitions where reference paths containing special characters didn’t resolve correctly.\n* Fixed issues in the request builder around inconsistent height and text alignment with the headers.\n* Fixed a bug in the Collection Runner where for some reason you could switch into a workspace you didn’t belong to.\n* Fixed a bug in the text editor in which the search text would overlap with the Console header.\n* Fixed an issue when deleting an API where the tab title would say “Loading...” instead of `“[DELETED]”`.\n* Bugfixes in code editors\n  * Fixed a bug where Postman variable suggestions did not close when clicking outside the editor.\n  * Fixed a bug where function names were highlighted differently in light theme\n  [#8241](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8241)\n  * Fixed a bug where JavaScript object spread operator was detected as incorrect syntax\n  [#7749](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7749)\n  * Fixed a bug where Postman variable suggestions were shown outside of relevant Postman Sandbox methods \n  [#7481](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7481)\n  * Fixed an issue where the code shown in the code editors was different from the one used during sending request\n  [#5775](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/5775)\n  * Fixed a bug where large code triggered incorrect syntax warnings\n  [#3385](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/3385)\n* Bugfixes in description editors\n  * Fixed a bug where bold text in markdown was not highlighted correctly when indented\n  [#4967](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/4967)\n  * Fixed a bug where Hangeul character did not render correctly\n  [#7910](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7910)\n  * Fixed a bug where shift + clicking a line above or below would not always include the active word\n  [#6091](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/6091)\n  * Fixed a bug where Unicode characters broke cursor positions\n  [#5309](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/5309)\n  * Fixed a bug where words with underscores were not highlighted correctly\n  [#2812](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/2812)\n"]},"channel":"stable","features":null,"gennotespagepath":"app\/postman\/win\/7.24.0\/releasenotes.html","downloadList":[{"filename":"Postman-win64-7.24.0-Setup.exe","filehash":"049213CE83C4371FE5C98E44C56522D28F2A4CB3","filesize":"83051104","fileurl":"https:\/\/dl.pstmn.io\/download\/version\/7.24.0\/windows64","filekind":"","fileos":"win","filearch":"","fileuploadprefix":"app\/postman\/win\/7.24.0\/","filekey":"app\/postman\/win\/7.24.0\/Postman-win64-7.24.0-Setup.exe"}]}