{"version":"7.22.1","datetime":"2020-04-08T19:29:23.000Z","timestamp":"1586374163","notes":{"Bug Fixes":["[GitHub #7212] - Fixed an issue where shortcut for two-pane view did not update settings","[GitHub #7976] - Fixed a bug wherein the environment variable preview box was getting hidden by the left side bar for resolutions less than 1280x1024","[GitHub #5078] - [APPSDK-72] Fixed a bug where selecting text a inside a cell in tabular editors would select the row instead","Reduced time taken to open a new tab when multiple tabs are already open","Fixed a bug where shared icon was not shown for shared collections","Fixed a bug where user was not able to tag other users multiple times in comments","Fixed a bug where Edit Workspace Modal had stale data about non-active workspace","[GitHub #133] - Fixed an issue with incorrect path variables in imported collection from OpenAPI schema.","[GitHub #7844] - Fixed an issue where app froze while importing Swagger or OpenAPI schema.","[GitHub #7895] - Fixed an issue where a --data-raw flag in a cURL request wasn't handled correctly.","[GitHub #173] - Fixed an issue with headers in request examples while importing OpenAPI.","[GitHub #7806] - Fixed an issue where some instances of \"-X\" present in a cURL request were parsed incorrectly.","Fixed an issue where variable context tooltip would be shown at an incorrect position for long variable names","[GitHub #5990] - Fixed an issue where typing URL was taking time due to large number of URL suggestions","[GitHub #8029] - Fixed a bug where two pane view in body tab was broken when form-data is selected as body type","[GitHub #7522] - Fixed a bug where OAuth1 was failing for requests with disabled urlencoded params","Fixed an issue where users were seeing 'Could not open Postman' error on launching Postman app v7.21.1"],"Improvements":["[GitHub #7929] - When closing a request, the dialog clarifies that changes won’t be saved for future close actions when opting out of confirmation.","[GitHub #6719] - Import GraphQL schemas as API","Improve response status, time and size tooltips to not dismiss immediately","[GitHub #7871] - Improved performance for downloading and saving large responses to file","[GitHub #8067] - Improved design for OAuth 2.0 \"Get New Access Token\" and \"Manage Access Tokens\" modals","Performance improvements in Environments Quick Preview","Added RAML 1.0 as API schema definition","[GitHub #6719] - Added JSON language support for GraphQL schema type"],"Features":["Enabled visibility into presence status of members in a workspace","Fork recommendation modal","Learn how to design and develop your APIs in Postman using a sample e-commerce API with a lesson"]},"channel":"stable","features":["Enabled visibility into presence status of members in a workspace","Fork recommendation modal","Learn how to design and develop your APIs in Postman using a sample e-commerce API with a lesson"],"gennotespagepath":"app\/postman\/win\/7.22.1\/releasenotes.html","downloadList":[{"filename":"Postman-win64-7.22.1-Setup.exe","filehash":"5F0D85FC0D7AF5128F9A6B2AD5D598A4962645AC","filesize":"81256544","fileurl":"https:\/\/dl.pstmn.io\/download\/version\/7.22.1\/windows64","filekind":"","fileos":"win","filearch":"","fileuploadprefix":"app\/postman\/win\/7.22.1\/","filekey":"app\/postman\/win\/7.22.1\/Postman-win64-7.22.1-Setup.exe"}]}