{"version":"7.32.0","datetime":"2020-09-08T11:41:09.000Z","timestamp":"1599565269","notes":{"Release Notes":["***\n### What's New\n* Static IPs are enabled by default on monitors for Business and Enterprise teams. You can also view the static IP details on the Create Monitor page for easy reference.\n* It’s easier to draft OpenAPI2 and OpenAPI3 schemas with new support for auto-complete.\n* You can more accurately depict API behavior with mock servers by simulating a 100ms, 300ms, or custom network delay. \n\n### Improvements\n* You can now import and configure multiple API schemas at once in Postman. \n* When inviting teammates to a workspace, we added a confirmation message to ensure any changes weren’t lost on closing the invitation window without saving.\n* Updated the placeholder value for the header prefix field in OAuth2, which previously implied that “Bearer” would be added by default if left blank\n[#8811](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8811)\n\n### Bug Fixes\n* Fixed a bug when adding empty params to the OAuth1 signature, where the signature would be calculated incorrectly\n[#8737](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8737)\n* Fixed a bug when entering a request query param with the value `hasOwnProperty` would cause the app to crash\n[#8924](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8924)\n* Fixed a bug when stopping a collection run would cause the app to crash\n[#8972](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8972)\n* Fixed a bug when changing workspaces, where newer collection runs wouldn’t sync.\n* Fixed a bug when filtering the workspace activity feed by user, where the list of users wouldn’t show up in the filter menu.\n"]},"channel":null,"features":null,"gennotespagepath":"app\/postman\/linux\/7.32.0\/releasenotes.html","downloadList":[{"filename":"Postman-linux-x64-7.32.0.tar.gz","filehash":"06AE0CEA9C476DF25F48DE8C84B298985391E9B7","filesize":"113377291","fileurl":"https:\/\/dl.pstmn.io\/download\/version\/7.32.0\/linux64","filekind":"","fileos":"linux","filearch":"","fileuploadprefix":"app\/postman\/linux\/7.32.0\/","filekey":"app\/postman\/linux\/7.32.0\/Postman-linux-x64-7.32.0.tar.gz"}]}