{"version":"7.28.0","datetime":"2020-07-13T11:25:11.000Z","timestamp":"1594639511","notes":{"Release Notes":["***\nHello! We hope you’re staying safe and healthy. Here’s what you can find in this Postman release:\n\n### Improvements\n* We've made several improvements to the request authoring experience by making the app easier to navigate and customize\n[#7035](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/7035),\n[#5903](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/5903):\n    * You can now drag the request and response panes, the sidebar, and the Find and Replace pane to resize and collapse them.\n    * We have also removed the top-level scroll to fix the scroll-within-a-scroll issue.\n* We have also improved the debugging experience by showing Console data directly in the app:\n    * When inspecting a response, you can now view the pre-request scripts, tests, and request logs by selecting the `Console` button on the app footer.\n    * You can also access the same Console pane from the Collection Runner, allowing you to get right to debugging all your runs without a moment's delay.\n* When sending requests, the “Use next generation URL processing” setting will be enabled by default. Learn more about this [URL processing system](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8154).\n* You can now join any workspace you don’t already belong to directly from the workspace switcher.\n\n### Bug Fixes\n* Fixed an issue when editing a JSON request body where Postman variables with escaped characters would not be highlighted correctly\n[#8616](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8616)\n* Fixed an issue when editing a GraphQL request body where the String type was incorrectly highlighted as `missing` type\n[#8567](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8657)\n* Fixed a bug when uploading a profile picture with a transparent background, where the stock picture would still be visible behind the user’s picture\n[#8577](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8577)\n* Fixed an issue where importing schemas via links wasn’t working\n[#8686](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8686)\n* Fixed an issue where code snippets for cURL, Java, NodeJS, Python, and Swift didn’t have correctly escaped single quotes in the URL\n[#8674](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8674)\n"]},"channel":"stable","features":null,"gennotespagepath":"app\/postman\/win\/7.28.0\/releasenotes.html","downloadList":[{"filename":"Postman-win64-7.28.0-Setup.exe","filehash":"7AF0C476482E0D969918960C8C4B567B309FCFA8","filesize":"91303008","fileurl":"https:\/\/dl.pstmn.io\/download\/version\/7.28.0\/windows64","filekind":"","fileos":"win","filearch":"","fileuploadprefix":"app\/postman\/win\/7.28.0\/","filethissync":true,"filekey":"app\/postman\/win\/7.28.0\/Postman-win64-7.28.0-Setup.exe"}]}