{"version":"7.29.0","datetime":"2020-07-22T11:37:51.000Z","timestamp":"1595417871","notes":{"Release Notes":["***\nHello! We hope you’re staying safe and healthy. Here’s what you can find in this Postman release:\n\n### What's New\n* When writing pre-request and test scripts, global pm.* functions, Node.js, and other Node modules from the Postman Sandbox will now appear in the autocomplete menu.\n* When authoring requests, you can now insert an `$isoTimestamp` variable from our library of dynamic variables.\n* You can now automatically validate your OpenAPI 3.0 specification while importing or editing it. \n\n### Improvements\n* A collection or environment that exists only in a single workspace, cannot be removed, but only deleted or shared\n[#4509](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/4509)\n* When using the workspace switcher, you can now use your keyboard’s arrow keys to navigate between the menu options.\n* When importing an OpenAPI specification, there is now support for parameter serialization.\n\n### Bug Fixes\n* Fixed a bug where after sending a request and opening a new tab, the tab for the previous request would be replaced by the new request tab\n[#6992](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/6992)\n* Fixed a bug where duplicating a collection, folder, request, or environment twice would give the same name to the duplicated entities\n[#8012](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8012)\n* Fixed a bug where examples response pane was not visible for small window height\n[#8797](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8797)\n* Fixed error state in share entity modal when the entity is not synced or deleted\n[#8676](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8676)\n* Fixed a bug when sharing an API element where zooming in would hide the action buttons\n[#8691](https:\/\/github.com\/postmanlabs\/postman-app-support\/issues\/8691)\n* Fixed a bug where after leaving a private team workspace, the workspace switcher would remain in a loading state.\n"]},"channel":null,"features":null,"gennotespagepath":"app\/postman\/linux\/7.29.0\/releasenotes.html","downloadList":[{"filename":"Postman-linux-x64-7.29.0.tar.gz","filehash":"5F0FBE4E8D11CE0EC20B03D66046430D0CF989A4","filesize":"104137680","fileurl":"https:\/\/dl.pstmn.io\/download\/version\/7.29.0\/linux64","filekind":"","fileos":"linux","filearch":"","fileuploadprefix":"app\/postman\/linux\/7.29.0\/","filekey":"app\/postman\/linux\/7.29.0\/Postman-linux-x64-7.29.0.tar.gz"}]}